package com.example.anees.utils.how_to_pray_helper

import com.example.anees.data.model.HowToPrayDto

var eidPrayerList = listOf(
    HowToPrayDto(
        title = "صلاة العيد",
        description ="ذهب أكثر أهل العلم إلى أن صلاة العيد سُنَّة مؤكدة\n" +
                "- ويُشترط لصحة أدائها ما يُشترط لصحة صلاة الجمعة، من الجماعة والإقامة، ولا تجب على المسافر على الراجح من أقوال أهل العلم, ويستحب صلاتها في جماعة.\n" +
                "أمّا وقت أدائها، فيبدأ من ارتفاع الشمس يوم العيد قَدْرَ رمح، ويقدر ذلك بخمس عشرة دقيقة تقريبًا بعد شروق الشمس، ويمتد وقت أدائها إلى الزوال (قُبيل أذان الظهر بقليل) فوقتها هو وقت صلاة الضحى\n" +
                " الدليل:\n" +
                "فعن ابن عباس رضي الله عنهما:(أَنَّ النَّبِيَّ صلى الله عليه وسلم صلى الْعِيدَ بِلا أَذَانٍ، وَلا إِقَامَةٍ) رواه أبو داود، وأصله في صحيح البخاري\n" ,
    image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%B9%D9%8A%D8%AF/p_eid.png?raw=true"
    ),
    HowToPrayDto(
        title = "صفة صلاة العيد",
        description ="صلاة العيد ركعتان\n" +
                "الركعة الاولى:\n" +
                "   يكبر فيها سبع تكبيرات قبل القراءة وذلك غير تكبيرة الإحرام\n" +
                "   ثم يقرأ الفاتحة وما تيسر من القرآن, ومن السنة قراءة سورة الاعلى او سورة ق في الركعة الاولى.\n" +
                "الركعة الثانية:\n" +
                "   يكبر فيها خمس تكبيرات غير تكبيرة الرفع من السجود\n" +
                "ثم يقرأ الفاتحة وما تيسر من القرآن, ومن السنة قراءة سورة الغاشية او سورة القمر.    \n" +
                "الدليل:  \nعن النُّعمانِ بنِ بَشيرٍ رَضِيَ اللهُ عنهما، قال: (كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم يقرأُ في العِيدينِ، وفي الجُمُعةِ بـسَبِّحِ اسْمَ رَبِّكَ الأَعْلَى، وهَلْ أَتَاكَ حَدِيثُ الغَاشِيَةِ)",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%B9%D9%8A%D8%AF/eid_prayer.png?raw=true"
    ),
)