package com.example.anees.utils.how_to_pray_helper

import com.example.anees.data.model.HowToPrayDto

var fearPrayerList = listOf(
    HowToPrayDto(
        title = "صلاة الخوف",
        description = "صلاة الخوف هي الصَّلاةُ المكتوبةُ يَحضُر وقتُها والمسلمونَ في مقاتلةِ العدوِّ، أو في حراسةِ المسلمينَ منهم " +
                "إلى آخِر الزَّمان، ولم تُنسَخْ، وهذا باتِّفاق المذاهبِ الفقهيَّة الأربعة.\n" +
                "والمراد بالخوف: الخوف من العدو، وتصلى صلاة الخوف إذا خاف المسلمون من العدو وواجهوا العدو وقت القتال.\n" +
                "\n" +
                "صلاة الخوف تؤدى بآذان وإقامة كسائر الصلوات.\n" +
                "\n" +
                "وصفة صلاة الخوف تختلف باختلاف شدة الخوف ، وباختلاف مكان العدو ، هل هو في اتجاه القبلة أم في جهة أخرى ؟\n" +
                "\n" +
                "جميعُ الصِّفاتِ المرويَّة عن النبيِّ صلَّى اللهُ عليه وسلَّم في صلاةِ الخوف  مُعتَدٌّ بها ؛ نصَّ عليه الحَنابِلَةُ  وهو قولُ طائفةٍ من السَّلَف ، واختاره الطبريُّ ، والخطابيُّ  وابنُ حزم ، والنوويُّ  وابنُ تَيميَّة ، وابنُ القيِّم ، والكمالُ ابنُ الهُمام ، والشوكانيُّ  وابنُ باز , وابنُ عثيمين ؛ وذلك جمعًا بين النُّصوصِ الواردةِ في صلاةِ الخوف.\n",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AE%D9%88%D9%81/p_fear.png?raw=true"
    ),
    HowToPrayDto(
        title = "شروطها واحكامها",
        description = "يشترط لصحة صلاة الخوف أن يكون القتال مشروعًا، وأن يوجد خوف من هجوم العدو أثناء الصلاة، فهي رخصة من الله تعالى مرتبطة بوجود الخوف لا بمجرد القتال، فلا تصح إلا إذا تحقق سبب مشروعيتها.\n" +
                "\n" +
                "فإن اقتضت مصلحة القتال حمل السلاح أثناء الصلاة وجب حمله، وإن لم تقتض ذلك استُحب حمله. والأفضل للمقاتل أن يثبت نظره نحو العدو خشية مباغتته، امتثالًا لقوله تعالى: \"وخذوا حذركم\". كما يُستحب للإمام أن يخفف الصلاة وألا يطيلها، إذ شُرعت صلاة الخوف للتيسير على المقاتلين مع مراعاة الحذر والحيطة.\n" +
                "\n" +
                "ويُعد الخوف عذرًا يُسقط اشتراط استقبال القبلة، فإن تمكن المصلّي من استقبالها فهو أولى وأكمل، وإلا فصلاته صحيحة.\n" +
                "\n" +
                "وقد جاءت صلاة الخوف على هيئات متعددة وصفات متباينة، فيجوز أداء أي صفة منها بحسب ما يناسب الموقف." +
                "\n" +
                " إذا لم يتمكن المقاتلون من صلاة الخوف جماعة فإنهم يصلونها فرادى، فإذا لم يستطيعوا فإنهم يصلونها كيفما أمكنهم مشاة أو ركبانا مستقبلي القبلة وغير مستقبليها يومئون للركوع والسجود برؤوسهم لقوله تعالى:{فَإِنْ خِفْتُمْ فَرِجَالاً أَوْ رُكْبَاناً}.\n",
        image = "https://raw.githubusercontent.com/Alikotb/Anees_Images/refs/heads/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B3%D9%82%D8%A7%D8%A1/rp_01.png"
    ),
    HowToPrayDto(
        title = "الطائفة الاولى",
        description = "هذه الصفة موافقة لظاهر القرآن, إذا كان العدو في غير اتجاه القبلة." +
                "\n" + "فيقسم قائد الجيش جيشه إلى طائفتين ، طائفة تصلّي معه ، وطائفة أمام العدو ، لئلا يهجم على المسلمين ، \n" +
                "\n" +
                "فيصلّي بالطائفة الأولى ركعة ، ثم إذا قام إلى الثانية أتموا لأنفسهم أي : نووا الانفراد وأتموا لأنفسهم ، والإِمام لا يزال قائماً ، ثم إذا أتموا لأنفسهم ذهبوا ووقفوا مكان الطائفة الثانية أمام العدو،\n" +
                "\n" +
                "وجاءت الطائفة الثانية ودخلت مع الإِمام في الركعة الثانية ، وفي هذه الحال يطيل الإِمام الركعة الثانية أكثر من الأولى لتدركه الطائفة الثانية ، فتدخل الطائفة الثانية مع الإِمام فيصلّي بهم الركعة التي بقيت ، ثم يجلس للتشهد ، \n" +
                "\n" +
                "فإذا جلس للتشهد قامت هذه الطائفة من السجود رأساً وأكملت الركعة التي بقيت وأدركت الإِمام في التشهد فيسلم بهم ." +
                "الادلـة:\n" +
                "أولًا: من الكِتاب\n" +
                "قال الله تعالى:وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ فَلْتَقُمْ طَائِفَةٌ مِنْهُمْ مَعَكَ وَلْيَأْخُذُوا أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا فَلْيَكُونُوا مِنْ وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَى لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ وَلْيَأْخُذُوا حِذْرَهُمْ وَأَسْلِحَتَهُمْ وَدَّ الَّذِينَ كَفَرُوا لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُمْ مَيْلَةً وَاحِدَةً وَلَا جُنَاحَ عَلَيْكُمْ إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَى أَنْ تَضَعُوا أَسْلِحَتَكُمْ وَخُذُوا حِذْرَكُمْ إِنَّ اللَّهَ أَعَدَّ لِلْكَافِرِينَ عَذَابًا مُهِينًا\n" +
                "[النساء:102]\n" +
                "ثانيًا: من السُّنَّة\n" +
                "روى البخاري (413) ومسلم (842) عَنْ مَالِكٍ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَمَّنْ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ ذَاتِ الرِّقَاعِ صَلَّى صَلاةَ الْخَوْفِ : ( أَنَّ طَائِفَةً صَفَّتْ مَعَهُ ، وَطَائِفَةٌ وِجَاهَ الْعَدُوِّ ، فَصَلَّى بِالَّتِي مَعَهُ رَكْعَةً ، ثُمَّ ثَبَتَ قَائِمًا ، وَأَتَمُّوا لأَنْفُسِهِمْ ، ثُمَّ انْصَرَفُوا فَصَفُّوا وِجَاهَ الْعَدُوِّ ، وَجَاءَتْ الطَّائِفَةُ الأُخْرَى فَصَلَّى بِهِمْ الرَّكْعَةَ الَّتِي بَقِيَتْ مِنْ صَلاتِهِ ، ثُمَّ ثَبَتَ جَالِسًا ، وَأَتَمُّوا لأَنْفُسِهِمْ ، ثُمَّ سَلَّمَ بِهِمْ ) قَالَ مَالِكٌ : وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ فِي صَلاةِ الْخَوْفِ ",
        image = "https://github.com/Alikotb/Anees_Images/blob/9e4e3ee10d45eb0b2b7bb3f797d8dd8c41a0adae/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AE%D9%88%D9%81/p_fear_1.png"
    ),
    HowToPrayDto(
        title = "الطائفة الثانية",
        description = "\nالتبديل مع الطائفة الثانية" +
                "وجاءت الطائفة الثانية ودخلت مع الإِمام في الركعة الثانية ، وفي هذه الحال يطيل الإِمام الركعة الثانية أكثر من الأولى لتدركه الطائفة الثانية ، فتدخل الطائفة الثانية مع الإِمام فيصلّي بهم الركعة التي بقيت ، ثم يجلس للتشهد ، \n" +
                "فإذا جلس للتشهد قامت هذه الطائفة من السجود رأساً وأكملت الركعة التي بقيت وأدركت الإِمام في التشهد فيسلم بهم." +
                "\n" +
                "الادلـة:\n" +
                "أولًا: من الكِتاب\n" +
                "قال الله تعالى: وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ فَلْتَقُمْ طَائِفَةٌ مِنْهُمْ مَعَكَ وَلْيَأْخُذُوا أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا فَلْيَكُونُوا مِنْ وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَى لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ وَلْيَأْخُذُوا حِذْرَهُمْ وَأَسْلِحَتَهُمْ وَدَّ الَّذِينَ كَفَرُوا لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُمْ مَيْلَةً وَاحِدَةً وَلَا جُنَاحَ عَلَيْكُمْ إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَى أَنْ تَضَعُوا أَسْلِحَتَكُمْ وَخُذُوا حِذْرَكُمْ إِنَّ اللَّهَ أَعَدَّ لِلْكَافِرِينَ عَذَابًا مُهِينًا\n" +
                "[النساء:102]\n" +
                "ثانيًا: من السُّنَّة\n" +
                "روى البخاري (413) ومسلم (842) عَنْ مَالِكٍ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَمَّنْ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ ذَاتِ الرِّقَاعِ صَلَّى صَلاةَ الْخَوْفِ : ( أَنَّ طَائِفَةً صَفَّتْ مَعَهُ ، وَطَائِفَةٌ وِجَاهَ الْعَدُوِّ ، فَصَلَّى بِالَّتِي مَعَهُ رَكْعَةً ، ثُمَّ ثَبَتَ قَائِمًا ، وَأَتَمُّوا لأَنْفُسِهِمْ ، ثُمَّ انْصَرَفُوا فَصَفُّوا وِجَاهَ الْعَدُوِّ ، وَجَاءَتْ الطَّائِفَةُ الأُخْرَى فَصَلَّى بِهِمْ الرَّكْعَةَ الَّتِي بَقِيَتْ مِنْ صَلاتِهِ ، ثُمَّ ثَبَتَ جَالِسًا ، وَأَتَمُّوا لأَنْفُسِهِمْ ، ثُمَّ سَلَّمَ بِهِمْ ) قَالَ مَالِكٌ : وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ فِي صَلاةِ الْخَوْفِ ",
        image = "https://github.com/Alikotb/Anees_Images/blob/9e4e3ee10d45eb0b2b7bb3f797d8dd8c41a0adae/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AE%D9%88%D9%81/p_fear_2.png"
    ),
)