package com.example.anees.utils.how_to_pray_helper

import com.example.anees.data.model.HowToPrayDto

val funeralPrayerList = listOf(
    HowToPrayDto(
        title = "صَلاةُ الجِنازةِ",
        description = "صَلاةُ الجِنازةِ لها تحريمٌ، وتكبيرٌ، وتحليلٌ، ويُستقبَلُ فيها القِبلةُ، ويُشرَعُ أن تُصلَّى بإمامٍ وصفوفٍ، ويُمنَعُ المصلِّي فيها من الكَلامِ." +
                "الدَّليل من الإجماع: نقَلَ الإجماعَ على ذلك: ابنُ تيميَّة\n" +
                ": (صلاة الجِنازة، فإنَّ لها تحريمًا وتحليلًا، ونُهِيَ فيها عن الكلام، وتُصلَّى بإمامٍ وصفوف، وهذا كلُّه متَّفَقٌ عليهـ\n" +
                "لا تصحُّ صلاةُ الجِنازة بغيرِ نيَّة، وهذا باتِّفاقِ المذاهبِ الفقهيَّة الأربعة: الحَنفيَّة والمالِكيَّة والشافعيَّة والحَنابِلَة\n" +
                "الأدلَّة: من السُّنَّة:\n" +
                "عن عُمرَ بن الخطَّابِ رَضِيَ اللَّهُ عنه، قال: سمعتُ رسولَ الله صلَّى الله عليه وسلَّم يقولُ: ((إنَّما الأعمالُ بالنيَّاتِ))\n" +
                "\n" +
                "اما بالنسبة لرفع اليدين أثناء التكبير : فالأفضل الرفع، وإن لم يرفع؛ فلا بأس، والأفضل الرفع؛ لأن الرسول ﷺ كان يرفع في تكبيرات الجنازة، ومثلها تكبيرات العيد، السنة الرفع؛ لأنها تكبير عن قيام، فأشبه تكبير الاستفتاح، وتكبير الركوع، يرفع في الصلوات كلها، إذا كبر رفع، وإذا كبر للركوع رفع، فالأفضل في التكبير للجنازة أن يرفع، وبعض أهل العلم قال: يرفع في الأولى فقط.",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AC%D9%86%D8%A7%D8%B2%D8%A9/fp_00.png?raw=true"
    ),
    HowToPrayDto(
        title = "صفة القيام",
        description ="يُشترَطُ أنْ يكونَ الميِّتُ بين يدَيِ الإمامِ، وتبطُلُ صلاةُ مَن تَقدَّم عليه، وهو مذهبُ الجمهورِ: الحَنفيَّة والشافعيَّة والحَنابِلَة" +
                "*الأدلَّة: عن أبي غالبٍ، قال:((رأيتُ أنسَ بنَ مالكٍ صلَّى على جِنازة رجُلٍ، فقامَ حِيالَ رأسِه، فجيءَ بجِنازة أخرى؛ بامرأةٍ، فقالوا: يا أبا حمزةَ، صلِّ عليها، فقام حيالَ وسَطِ السَّريرِ، فقال له العلاءُ بنُ زياد: يا أبا حمزةَ، هكذا رأيتَ رسولَ اللهِ صلَّى الله عليه وسلَّم قامَ مِن الجِنازةِ مَقامَك مِن الرَّجُلِ، وقامَ مِن المرأةِ مقامَك من المرأةِ؟ قال: نعَمْ ))\n" +
                "قيامُ القادرِ لصلاةِ الجِنازة رُكنٌ، وهذا باتِّفاقِ المذاهبِ الفقهيَّة الأربعة: الحَنفيَّةوالمالِكيَّة والشافعيَّة والحَنابِلَة\n" +
                "\n" +
                "*الأدلَّة: عن عِمرانَ بنِ حُصَينٍ رَضِيَ اللَّهُ عنه، قال:((كانتْ بي بواسيرُ، فسألتُ النبيَّ صلَّى الله عليه وسلَّم عن الصَّلاةِ، فقال: صَلِّ قائمًا... ))" ,
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AC%D9%86%D8%A7%D8%B2%D8%A9/fp_01.png?raw=true"
    ),
    HowToPrayDto(
        title = "التكبيرة الأولى",
        description = "يتم قراءة الفاتحة بعد التكبيرة الاولى" +
                "قراءةُ الفاتحةِ فرضٌ في صلاةِ الجِنازة، وهو مذهبُ الشافعيَّة والحَنابِلَة وهو قولُ بعض السَّلَف وهو مذهَبُ الظَّاهريَّة والشوكانيِّ و ابنِ باز، و ابنِ عُثَيمين\n" +
                "**الأدلَّة من السُّنَّة:**\n" +
                "1-عن طلحةَ بنِ عبدِ اللهِ بنِ عوفٍ، قال:((صليتُ خلفَ ابنِ عبَّاس رَضِيَ اللَّهُ عنهما على جِنازة، فقرَأَ بفاتحةِ الكتابِ، قال: لِيَعْلموا أنَّها سُنَّةٌ ))\n" +
                "2-عن أَبي أُمامةَ رَضِيَ اللَّهُ عنه أنَّه قال:((السُّنَّة في الصَّلاةِ على الجِنازة أن يَقرأَ في التكبيرةِ الأولى بأمِّ القرآنِ مُخافتةً، ثم يُكبِّر ثلاثًا، والتسليمُ عندَ الآخِرة ))\n" +
                "\n" +
                "3-عن عُبادةَ بنِ الصَّامت رَضِيَ الله عنه: أنَّ رسولَ اللهِ صلَّى الله عليه وسلَّم، قال:((لا صلاةَ لِمَن لم يقرأْ بفاتحةِ الكتاب ))",
        image ="https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AC%D9%86%D8%A7%D8%B2%D8%A9/fp_02.png?raw=true"
    ),
    HowToPrayDto(
        title = "التكبيرة الثانية",
        description ="بعد التكبيرة الثانية الصلاة على النبي-صلى الله عليه وسبم" +
                "الصَّلاةُ على النبيِّ صلَّى الله عليه وسلَّم فرضٌ في صلاةِ الجِنازة، وهو مشهورُ مذهبِ الشافعيَّةومذهبُ الحَنابِلَة ، واختاره ابنُ باز وابن عثيمين\n" +
                "\n" +
                "الأدلَّة: عن أبي أُمامةَ بنِ سَهلٍ، أنَّه أخبرَه رجلٌ من أصحابِ النبيِّ صلَّى الله عليه وسلَّم:((أنَّ السُّنَّة في الصَّلاةِ على الجِنازة أن يُكبِّرَ الإمامُ، ثم يقرأَ بفاتحةِ الكتابِ- بعدَ التكبيرة الأولى- سِرًّا في نفْسِه، ثم يُصلِّيَ على النبيِّ صلَّى الله عليه وسلَّم، ويُخلِصَ الدُّعاءَ للجِنازةِ في التكبيراتِ، لا يقرأُ فى شىءٍ منهنَّ، ثم يُسلِّم... ))",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AC%D9%86%D8%A7%D8%B2%D8%A9/fp_02.png?raw=true"
    ),
    HowToPrayDto(
        title = " التكبيرة الثالثة",
        description = "بعد التكبيرة الثالثة الدعاء للميت" +
                "الدُّعاءُ للميِّت رُكنٌ في صلاةِ الجِنازة وهو مذهبُ الجُمهورِ: المالِكيَّة ، والشافعيَّة ، والحَنابِلَة\n" +
                "الأدلَّة: عن أبي هُرَيرَة رَضِيَ اللَّهُ عنه، قال: سمعتُ رسولَ الله صلَّى الله عليه وسلَّم يقول:((إذا صليتُم على الميِّتِ، فأخْلِصوا له الدُّعاءَ ))\n" +
                "\n" +
                "لأنَّ القصدَ من هذه الصَّلاةِ الدُّعاءُ للميِّت؛ فلا يجوزُ الإخلالُ بالمقصودِ",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AC%D9%86%D8%A7%D8%B2%D8%A9/fp_02.png?raw=true"
    ),
    HowToPrayDto(
        title = "التكبيرة الرابعة",
        description ="اختَلَف العلماءُ في مشروعيَّةِ الدُّعاءِ للميِّتِ بعدَ التكبيرةِ الرَّابعة، على قولين:" +
                "القولُ الأوَّل:\n" +
                "يُشرَعُ الدُّعاءُ للمَيِّت بعدَ التكبيرةِ الرابعةِ وقبلَ التَّسليمِ، وهذا مذهبُ المالِكيَّة ، والشافعيَّة ، واختارَه بعضُ الحَنفيَّة ، وروايةٌ عن أحمد، واختاره الشوكانيُّ ، و ابنُ عُثَيمين، والألباني؛ وذلك لأنَّه قيامٌ في صلاةٍ، فكان فيه ذِكرٌ مشروعٌ، كالذي قبل التكبيرةِ الرابعةِ\n" +
                "القول الثاني\n" +
                ":أنَّه ليس بعدَ التَّكبيرةِ الرَّابعةِ دعاءٌ، وإنَّما يليها السَّلامُ، وهو مذهبُ الحَنفيَّة ، والحَنابِلَة ، وقولٌ عند المالِكيَّة ، واختارَه ابنُ باز\n" +
                "\n" +
                "؛ وذلك لأنَّ الدُّعاءَ في صلاةِ الجِنازة بمنزلةِ القراءةِ في غيرِها، فلو دعا بعدَ الرَّابعةِ لاحتاجَ إلى تكبيرةٍ تَفصِلُ بين القراءةِ والسَّلامِ، كما يَفصِلُ الركوعُ بين القراءةِ والتَّسليمِ",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AC%D9%86%D8%A7%D8%B2%D8%A9/fp_02.png?raw=true"
    ),
    HowToPrayDto(
        title = "التسليم",
        description = "التَّسليمُ ركنٌ في صلاةِ الجِنازة، وهو مذهبُ الجمهورِ: المالِكيَّة، والشافعيَّة، والحَنابِلَة" +
                "اختلَفَ أهلُ العِلمِ في عددِ التَّسليمِ في صلاةِ الجِنازة: هل هو تسليمةٌ أو تسليمتان ؛ على قولين:\n" +
                "القول الأوّل\n" +
                "يُستحَبُّ في صَلاةِ الجِنازة التَّسليمُ تَسليمتَينِ، وهو مذهبُ الحَنفيَّة ،والأصحُّ عند الشَّافعيَّة ، وهو قولُ ابنِ حزمٍ\n" +
                "\n" +
                "القول الثاني: يُستحبُّ في صَلاةِ الجِنازة الاقتصارُ على تسليمةٍ واحدةٍ، وهو مذهبُ المالِكيَّة، والحَنابِلَة، وهو القولُ القديمُ للشافعي، وقال به بعضُ السَّلَفِ، وهو مذهبُ جماهيرِ أهلِ العِلمِ من السَّلَفِ والخَلف، وهو اختيارُ ابنِ المنذرِ، وابنِ باز، وابنِ عُثَيمين",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%AC%D9%86%D8%A7%D8%B2%D8%A9/fp_03.jpeg?raw=true"
    ),
)