package com.example.anees.utils.how_to_pray_helper

import com.example.anees.data.model.HowToPrayDto

val istikharaPrayerList = listOf(
    HowToPrayDto(
        title = "صلاةُ الاستخارةِ",
        description = "صلاةُ الاستخارةِ سُنَّةٌ، وهذا باتفاق المذاهب الفقهية الأربعة: الحنفية، والمالكية، والشافعية، والحنابلة" +
                "الدَّليلُ مِنَ السُّنَّة:\n" +
                "عن جابرِ بنِ عبدِ اللهِ رَضِيَ اللهُ عنه، قال: كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم يُعلِّمُ أصحابَه الاستخارةَ في الأمورِ كلِّها، كما يُعلِّم السورةَ من القرآنِ؛ يقول:((إذا همَّ أحدُكم بالأمرِ فلْيركَعْ ركعتينِ من غيرِ الفريضةِ، ثم لْيقُل: اللهمَّ إني أستخيرُك بعِلمك، وأستقْدِرُكَ بقُدرتِك، وأسألُك من فَضلِك؛ فإنَّك تَقدِرُ ولا أَقدِرُ، وتَعلمُ ولا أَعلمُ، وأنت علَّامُ الغيوب، اللهمَّ فإنْ كنتَ تَعلَمُ هذا الأمْرَ- ثم تُسمِّيه بعَينِه- خيرًا لي في عاجلِ أمْري وآجلِه- قال: أو في دِيني ومعاشي وعاقبةِ أمري- فاقْدُرْه لي، ويَسِّره لي، ثم بارِكْ لي فيه، اللهمَّ وإنْ كنتَ تعلمُ أنَّه شرٌّ لي في دِيني ومعاشي وعاقبةِ أمْري- أو قال: في عاجِلِ أمْري وآجِلِه- فاصْرِفني عنه، واقدُرْ لي الخيرَ حيثُ كانَ ثمَّ رضِّني به ))\n" +
                "وإذا كان لا يعرف هذا الدعاء يدعو بما تيسر، يقول: اللهم اقدر لي الخير، اللهم يسر لي الخير، اللهم اشرح صدري لهذا السفر إن كان خيرًا، اللهم اشرح صدري لهذا الزواج إن كان خيرًا، يدعو بما يفهم، بما يعرف، بعد السلام، يرفع يديه ويدعو بعد الصلاة الركعتين\n" +
                "الدُّعاءُ في صلاةِ الاستخارةِ يكونُ عقِبَ السَّلامِ، وهذا مذهبُ الجمهور: المالِكيَّة ، والشافعيَّة ، والحَنابِلَة ، وحُكي الإجماعُ على ذلك\n" +
                "\n" +
                "إذا لم يتبيَّنْ للمستخيرِ أمرٌ يختارُه، فله تَكرارُ الاستخارةِ، وهذا مذهبُ الجمهور: الحَنَفيَّة، والمالِكيَّة، والشافعيَّة",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%AE%D8%A7%D8%B1%D8%A9/ip_00.png?raw=true"
    )
)