package com.example.anees.utils.how_to_pray_helper

import com.example.anees.data.model.HowToPrayDto

val prayList = listOf(
    HowToPrayDto(
        title = "أركان الصلاة",
        description = "1-القيام في الفرض على القادر.\n" +
                "2-تكبيرة الإحرام وهي \"الله أكبر\".\n" +
                "3-قراءة الفاتحة.\n" +
                "4-الركوع وأقله أن ينحني بحيث يمكنه مس ركبتيه بكفيه، وأكمله أن يمد ظهره مستويا ويجعل رأسه حياله.\n" +
                "5-الرفع من الركوع.\n" +
                "6-الاعتدال قائما.\n" +
                "7-السجود وأكمله تمكين جبهته وأنفه وكفيه وركبتيه وأطراف أصابع قدميه من محل سجوده. وأقله وضع جزء من كل عضو.\n" +
                "8-الرفع من السجود.\n" +
                "9-الجلوس بين السجدتين. وكيف جلس كفى، والسنة أن يجلس مفترشا على رجله اليسرى وينصب اليمنى ويوجهها إلى القبلة.\n" +
                "10-الطمأنينة وهي السكون في كل ركن فعلي.\n" +
                "11-التشهد الأخير.\n" +
                "12-الجلوس للتشهد الأخير وللتسليمتين.\n" +
                "13-التسليمتان وهو أن يقول مرتين: السلام عليكم ورحمة الله، ويكفي في النفل تسليمة واحدة، وكذا في صلاة الجنازة.\n" +
                "\n" +
                "14-  ترتيب الأركان كما ذكرنا، فلو سجد مثلا قبل ركوعه عمدا بطلت صلاته، وسهواً لزمه الرجوع ليركع ثم يسجد.",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_00.png?raw=true"
    ),
    HowToPrayDto(
        title = "النية و إستقبال القبلة",
        description = "النية لابد منها في العبادات كلها لقول النبي ﷺ: إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فالنية بالقلب في الصلاة في الحج في الصيام في جميع العبادات في الصدقة إلى غير ذلك، لكن التلفظ غير مشروع، كونه يقول نويت بلسانه يتكلم: نويت أن أصلي الظهر" +
                "\n" +
                "من شروط صحة الصلاة استقبال القبلة ولا تصح الصلاة إلا به، لأن الله تعالى أمر به وكرر الأمر به في القرآن الكريم، قال تعالى: {وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَحَيْثُ مَا كُنْتُمْ فَوَلُّوا وُجُوهَكُمْ}",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_01.png?raw=true"
    ),
    HowToPrayDto(
        title = "تكبيرة الإحرام",
        description = "ثم كان -صلى الله عليه وسلم -  يستفتح الصلاة بقوله: {الله أكبر}، وأمر بذلك المسيء صلاته، وقال له: " +
                "{ إنه لا تتم صلاة لأحد من الناس حتى يتوضأ، فيضع الوضوء مواضعه، ثم يقول: الله أكبر}\n" +
                " وكان يقول:{ مفتاح الصلاة الطهور ، وتحريمها التكبير ، وتحليلها التسلم}\n" +
                "وكان يرفع صوته بالتكبير حتى يسمع من خلفه\n" +
                "\n" +
                "وكان يقول: { إذا قال الإمام: الله أكبر؛ فقولوا: الله أكبر}",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_02.png?raw=true"
    ),
    HowToPrayDto(
        title = "صفة القيام",
        description = "و كان-صلى الله عليه وسلم- يضع يده اليمنى على اليسرى ، وكان يقول:{ إنا معشر الأنبياء أمرنا بتعجيل فطرنا وتأخير سحورنا ، وأن نضع أيماننا عل شمائلنا في الصلاة }" +
                "و مر برجل وهو يصل وقد وصع يده اليسرى عل اليمنى فانتزعها ، ووضع اليمنى عل اليسرى \n" +
                "وكان يضع اليمنى عل ظهر كفه اليسرى والرسغ والساعد \n" +
                "وأمر بذلك أصحابه و كان- أحيانا -يقبض باليمنى على اليسرى و كان يضعها عل الصدر\n" +
                "و كان إذا صلى طأطأ رأسه ، ورمى ببصره نحو الأرض \n" +
                "و  كان ينهى عن رفع البصر إلى السماء ويؤ كد في النهي حتى قال:\n" +
                "{لينتهين أقوام يرفعون أبصارهم إلى السماء في الصلاة أو لا ترجع إليهم (وفي رواية: أو لتخطفن أبصارهم)}",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_03.png?raw=true"
    ),
    HowToPrayDto(
        title = "القراءة",
        description = "ثم كان يستفتح القراءة بأدعية كثيرة متنوعة ، يحمد الله تعالى فيها ، و يمجده ويثني عليه ، وقد أمر بذلك «المسىء صلاته » فقال له : لا تتم صلاة لأحد من الناس حتى يكبر ، ويحمد الله جل وعز ويثني عليه ، ويقرأ بما تيسر من القرآن...»" +
                "من أدعية الاستفتاح : عن جابرٍ-رضي الله عنه-:((أنَّ رسولَ اللهِ صلَّى اللهُ عليه وسلَّم كان إذا افتَتَح الصَّلاةَ قال: سبحانَك اللهمَّ وبحمدِك، وتبارَك اسمُك، وتعالى جَدُّكَ، ولا إلهَ غيرُك، وجَّهتُ وجهيَ للذي فطَر السمواتِ والأرضَ حنيفًا وما أنا من المُشرِكين، إنَّ صلاتي ونُسُكي ومحيايَ ومماتي للهِ ربِّ العالَمينَ\n" +
                " ثم كان-صلى الله عليه وسلم- يستعيذ بالله تعالى فيقول  «أعوذ بالله من الشيطان الرجيم من همزه ونفخه و نفثه ثم يقراء بسم الله الرحمن الرحيم ولا يجهر بها  ثم يقراء الفاتحة ويقطعها آية آية \n" +
                "وكان يعظم من شأن هذه السورة، فكان يقول : { لا صلاة لمن لا يقرأ فيها بفاتحة الكتاب فصاعدا ، وفى\n" +
                " لفظ: « لا تجزىء صلاة لا يقرأ الرجل فيها بفاتحة الكتاب} " +
                "قال جابر : « كنا نقرأ في الظهر والعصر خلف الامام في الركعتين الأوليين بفاتحة الكتاب وسورة، وفي الأخريين بفاتحة الكتاب ثم كان  إذا انتهى من قراءة الفاتحة قال: « امين » ، يجهر ويمد بها صوته \n" +
                "ثم كان يقرأ بعد الفاتحة  سورة غيرها ، وكان يطيلها أحيانا  ويقصر ها أحيانا لعارض سفر ، أو سعال، أو مرض ، أو بكاء صبي\n" +
                "وأما في صلاة الليل فكان تارة يسر ، وتارة يجهر كان إذا قرأ وهو في البيت يسمع قراءته من في الحجره» و كان ربما رفع صوته أكثر من ذلك حتى يسمعه من كان على عرشه أي خارج الحجرة \n" +
                "وبذلك أمر أبا بكر وعمر رضي الله عنهما ، وذلك حينا « خرج ليلة فإذا هو بأي بكر رضي الله عنه يصل يخفض من صوته ، ومر بعمر بن الخطاب رضي الله عنه وهو يصلي رافعا صوته، فلما اجتمعا عند النبي قال: يا أبا بكرا مررت بك وأنت تصل تخفض من صوتك ؟ » . فقال: أسمعت من ناجيت  يا رسول الله وقال لعمر: و مررت بك وأنت تصل رافعا صوتك ؟ فقال يا رسول الله أوقظ الونسان ،وأطرد الشيطان. فقال النبي يا أبا بكر ا ارفع من صوتك شيئا، وقال لعمر: (اخفض من صوتك شيئا",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_04.png?raw=true"
    ),
    HowToPrayDto(
        title = "الركوع",
        description = "ثم كان إذا فرغ من القراءة سكت سكتة ثم رفع يديه على الوجوه المتقدمة في «تكبيرة الافتتاح»، وكبر، وركع وكان يضع كفيه عل ركبتيه، و كان يمكن يديه من ركبتيه كأنه قابض عليها و كان يفرج بين أصابعه و كان إذا ركع بسط ظهره وسواه حتى لو صب عليه الماء لاستقر وكان لا يصب راسه ولا يرفعها إنما تكون بمستوى الظهر \n" +
                "وكان يطمئن في ركوعه  و كان يقول: «أسوأ الناس سرقة الذي يسرق من صلاته». قالوا : يا رسول الله ! و كيف يسر ق من صلاته ؟ قال: « لا يتم ركوعها وسجودها\n" +
                "وكان يقول في هذا الركن أنواعا من الأذكار والادعية، تارة بهذا وتارة بهذا  \n" +
                " 1-«سبحان ربي العظم (ثلاث مرات)  وكان - أحيانا - يكررها أكثر من ذلك -\n" +
                " 2-سبوح قدوس رب الملائكة والروح\n" +
                "و كان يجعل ركوعه ، وقيامه بعد الر كوع، وسجوده، وجلسته السجدتين قريبا من السواء و كان ينهى عن قراءة القرآن في الركوع والسجود",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_05.png?raw=true"
    ),
    HowToPrayDto(
        title = "القيام من الركوع",
        description = "ثم كان يرفع صلبه من الركوع قائلا : ( سمع الله لمن حمده ) وكان إذا رفع رأسه استوى حتى يعود كل فقار مكانه ثم كان يقول وهو قائم: ( ربنا و لك الحمد) \n" +
                "\"ربناا ولك الحمد، حمدا كثيرا طيبا مباركا فيه، مباركا عليه؛ كما يحب ربنا ويرضى\"\n" +
                "قاله رجل كان يصلي وراءه بعدما رفع رأسه من الركعة وقال: «سمع الله لمن حمده»، فلما انصرف رسول الله قال «من المتكام آنفا» فقال الرجل: أنا يا رسول اللها فقال رسول الله لقد رايت بضعة وثلاثين ملكا يبتدرونها أيهم يكتبها أولا\n" +
                "\n" +
                "وكان يقول: لا ينظر الله عز وجل إلى صلاة عبد لا يقيم صلبه بين ركوعها وسجودها",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_06.png?raw=true"
    ),
    HowToPrayDto(
        title = "السجود",
        description = "ثم كان يكبر ويهوي ساجدا ثم يسجد حتى تطمئن مفاصله \n" +
                "وكان يضع يديه على الأرض قبل ركبتيه  وكان يأمر بذلك فيقول: « إذا سجد أحدك فلا يبرك كا يبرك البعير ، وليضع يديه قبل ركبتيه\n" +
                "و كان يعتمد عل كفيه ويبسطها  ويضم أصابعها ويوجهها قبل القبلة  وكان يحعلها حذو منكميه وأحيانا وحذو أذنيه وكان يمكن أنفه وجبهته من الأرض \n" +
                "و كان يمكن أيضا ركبتيه وأطراف قدميه و يستقبل بصدور قدميه و بأطراف أصابعها القبلة و يرص عقبيه و ينصب رجليه و أمر به  وكان يفتح أصابعها\n" +
                "فهذه سبعة أعضاء كان يسجد عليها: الكفان ، والركبتان والقدمان، والجبهة، والأنف\n" +
                "وكان لا يفترش ذراعيه بل كان يرفعها عـن الأرض ويباعدها عن جنبيه حتى يبدو بياض إبطيه من ورائه\n" +
                "وكان يقول في هذا الركن أنواعا من الأذكار والأدعية، تارة\n" +
                " هذا ، وتارة هذا " +
                "١ - «سبحان ري الأعلى (ثلاث مرات)و كان - أحيانا ـ يكررها أكثر من ذلك\n" +
                "وكان يقول ما من امتي من أحد إلا وأنا أعرفه يوم القيامة \n" +
                "قالوا: وكيف تعرفهم يارسول الله ! في كثرة الخلائق ؟ قال : « أرأيت لو دخلت\n" +
                "صيرة فيها خيل دهم بهم) ، وفيها فرس أغر محجل!\"\" أما كنت تعرفه\n" +
                "منها ؟ . قال : بلى. قال:  فإن أمتي يو مثذ غر  من السجود، محجلون الوضوء",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_07.jpeg?raw=true"
    ),
    HowToPrayDto(
        title = "الرفع من السجود",
        description = "ثم كان يرفع رأسه من السجود مكبرا ثم يفرش رجله اليسرى فيقعد عليها مطمئنا وكان ينصب رجله اليمنى ويستقبل بأصابعها القبلة وكان- صلى الله عليه وسلم- يطمئن حتى يرجع كل عظم إلى موضعه \n" +
                "وكان يقول في هذه الجلسة\n" +
                "١ - «اللهم ( وفي لفظ: رب) اغفر لي، وارحمني ، واجبرني وارفعني ، واهدني،  وعافني، وارزقني، وتارة يقول\n" +
                "٢-  رب! اغفر لي اغفر لي",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_08.jpg?raw=true"
    ),
    HowToPrayDto(
        title = "السجود الثاني ",
        description = "ثم كان يكبر ويسجد السجدة الثانية (على نفس النحو السابق ذكره في السجدة الأولى)\n" +
                " ثم كان ينهض معتمدا عل الأرض إلى الر كعة الثاني و كان يعجن في الصلاة: يعتمد عل يديه إذا قام",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_07.jpeg?raw=true"
    ),
    HowToPrayDto(
        title = "الركعة الثانية",
        description = "على نفس النحو السابق ذكره في جميع الخطوات ياتي المصلي بالركعة الثانية  ثم يجلس للتشهد الأول في الصلوات(الظهر ,العصر,المغرب,العشاء) أما إن كانت صلاة الصبح فيجلس للتشهد الثاني",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_200.png?raw=true"
    ),
    HowToPrayDto(
        title = "التشهد الأول ",
        description = "ثم كان-صلى الله عليه وسلم- يجلس للتشهد بعد الفراغ من الر كعة الثانية ، فإذا كانت الصلاة ركعتين كالصبح جلس مفترشا كما كان يجلس بين السجدتين وكذلك «يجلس في التشهد الأول» من الثلاثية أو الرباعية  \n" +
                "فإذا جلست في وسط الصلاة فاطمئن ، وافترش فخذك اليسرى ثم تشهد\n" +
                "و كان إذا قعد في التشهد؛ وضع كفه اليمنى عل فخذه ( وفي رواية\n" +
                "ركبته ) اليمنى ، ووضع كفه اليسرى على فخذه ( وفي رواية: ركبته ) اليسرى باسطها عليها \n" +
                "و كان يضع حد مرفقه الأيمن عل فخذه اليمنى\n" +
                " ونهى رجلا وهو جالس معتمد عل يده اليسرى في الصلاة فقال( إنها صلاة اليهود)\n" +
                "وكان يبسط كفه اليسرى عل ركبته اليسرى ، ويقبض أصابع كفه اليمنى كلها ، ويشير إصبعه التي تلي الابهام إلى القبلة، ويرمي ببصره إليها\n" +
                "و كان إذا أشار بإصبعه وضع إبهامه عل إصبعه الوسطى وتارة كان يحلق بهما حلقة \n" +
                "و كان يرفع إصبعه يحركها يدعو بها \n" +
                "\n" +
                "صيغة التشهد: {التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلَامُ عَلَيْكَ أيُّها النبيُّ ورَحْمَةُ اللهِ وبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وعلَى عِبَادِ اللهِ الصَّالِحِينَ، أشْهَدُ أنْ لا إلَهَ إلَّا اللَّهُ وأَشْهَدُ أنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ}",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_09.jpeg?raw=true"
    ),
    HowToPrayDto(
        title = "القيام للركعة الثالية والرابعة",
        description = "ثم كان ينهض إلى الركعة الثالثة مكبرا ، وأمر به «المسييء\n" +
                "صلاته» في قوله: «ثم اصنع ذلك في كل ركعة وسجدة» كما تقدم.\n" +
                "وكان إذا قام من القعدة كبر ، ثم قام و كان يرفع يديه مع هذا التكبير أحيانا\n" +
                "وكان إذا أراد القيام إلى الركعة الرابعة قال: ( الله أكبر )\n" +
                "وأمر به «المسيء صلاته» كا تقدم انفا.\n" +
                "\n" +
                "و كان يقرأ في كل مـن الركعتين: الفاتحة، وكان ربما أضاف اليها في صلاة الظهر بضع آيات",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_02.png?raw=true"
    ),
    HowToPrayDto(
        title = "التشهد الثاني ",
        description = "ثم كان بعد أن يتم الركعة الرابعة يجلس للتشهد الأخير وكان يأمر فيه بما أمر به في الأول ، ويصنع فيه ما كان يصنع في الأول إلا أنه « كان يقعد فيه متوركا “ يفضي بور كه \" اليسرى إلى الأرض ويخرج قدميه من ناحية واحدة، و ويجعل اليسرى تحت فخذه وساقه  و ينصب اليمنى ، وربما فرشها أحيانا و كان يلقم كفه اليسرى ركبته، يتحامل عليها  وسن فيه الصلاة عليه كا سن ذلك في التشهد الأول\n" +
                "\n" +
                "صيغة التشهد: {التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلَامُ عَلَيْكَ أيُّها النبيُّ ورَحْمَةُ اللهِ وبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وعلَى عِبَادِ اللهِ الصَّالِحِينَ، أشْهَدُ أنْ لا إلَهَ إلَّا اللَّهُ وأَشْهَدُ أنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ,اللَّهمَّ صلِّ على مُحمَّدٍ، وعلى آلِ مُحمَّدٍ، كما صلَّيتَ على آلِ إبراهيمَ، إنَّك حَميدٌ مَجيدٌ، اللَّهمَّ بارِكْ على مُحمَّدٍ، وعلى آلِ مُحمَّدٍ، كما بارَكتَ على آلِ إبراهيمَ، إنَّك حميدٌ مَجيدٌ}",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_09.jpeg?raw=true"
    ),
    HowToPrayDto(
        title = "التسليم",
        description = "ثم كان يسلم عن يمينه : « السلام عليكم ورحمة اللهحتى يرى\n" +
                "بياض خده الأيمن ، وعن يساره: السلام عليكم ورحمة الله 1 حتى يرى بياض خده الأيسر \n" +
                "وكان أحيانا يزيد في التسليمة الأولى:  وبر كاته",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%A7%D9%84%D8%B5%D9%84%D8%A7%D8%A9/p_10.png?raw=true"
    ),
)