package com.example.anees.utils.how_to_pray_helper

import com.example.anees.data.model.HowToPrayDto

val rainPrayerList = listOf(
    HowToPrayDto(
        title = "صلاة الاستسقاء ",
        description = "الاستسقاءُ لُغةً: اسْتِفْعالٌ مِن طَلب السُّقْيا، أَي: إنْزال الغَيْثِ عَلَى البلادِ والعِبادِ" +
                "الاستسقاءُ اصطلاحًا: طلبُ إنزالِ المطر من اللهِ تعالى بكيفيَّةٍ مخصوصةٍ، عندَ الحاجَةِ إليه\n" +
                "صلاةُ الاستسقاءِ سُنَّةٌ، وهذا مذهبُ الجمهورِ: المالِكيَّة ، الشافعيَّة، والحَنابِلَة، وبه قال محمَّد و أبو يوسف من الحَنَفيَّة، وحُكي الإجماعُ على مشروعيَّتها\n" +
                "الأَدِلَّةُ مِنَ السُّنَّة:\n" +
                "1-عن عبدِ اللهِ بنِ زيدِ بنِ عاصمٍ، قال:((رأيتُ النبيَّ صلَّى اللهُ عليه وسلَّم يومًا خرَج يَستسقي، قال: فحوَّل إلى الناسِ ظَهرَه، واستقبل القِبلةَ يَدْعو، ثم حوَّلَ رِداءَه، ثم صلَّى لنا ركعتينِ، جهَر فيهما بالقِراءةِ ))\n" +
                "2-عن عائشة رَضِيَ اللهُ عنها، قالت:((شكَا الناسُ إلى رسولِ الله صلَّى اللهُ عليه وسلَّم قحوطَ المطرِ، فأمَرَ بمِنبَرٍ فوُضِع له في المصلَّى، ووَعَد الناس يومًا يَخرُجون فيه، قالت عائشةُ\n" +
                ": فخرَج رسولُ اللهِ صلَّى اللهُ عليه وسلَّم حين بدأ حاجبُ الشَّمس، فقَعَد على المِنبَرِ، فكَبَّر صلَّى اللهُ عليه وسلَّم وحمِد الله عزَّ وجلَّ، ثم قال: إنَّكم شكوتم جَدْبَ دِيارِكم، واستئخارَ المطرِ عن إبَّان زَمانِه عنكم، وقدْ أمرَكم الله عزَّ وجلَّ أن تَدْعُوه، ووعدَكم أن يَستجيبَ لكم... ثم رفَع يديه، فلم يزلْ في الرَّفْعِ حتى بدَا بياضُ إِبْطَيه، ثم حوَّل إلى الناسِ ظَهرَه، وقَلَبَ أو حَوَّل رداءَه، وهو رافعٌ يديه، ثم أقْبَل على الناسِ، ونزَل فصَلَّى ركعتينِ، فأنشأ اللهُ سحابةً، فرعدَتْ وبرَقتْ، ثم أمطرتْ بإذن الله، فلم يأتِ مسجدَه حتى سالتِ السيولُ، فلمَّا رأى سُرعتَهم إلى الكِنِّ ضَحِكَ صلَّى اللهُ عليه وسلَّم حتى بدَتْ نواجذُه، فقال: أَشهَدُ أنَّ اللهَ على كلِّ شيءٍ قديرٌ، وأنِّي عبدُ اللهِ ورسولُه ))\n" +
                "إذا استَسْقَى الناسُ ولم يُسْقَوا، شُرِع لهم تَكرارُ الاستسقاءِ، وهذا باتِّفاقِ المذاهبِ الفقهيَّة الأربعة: الحَنَفيَّة، والمالِكيَّة، والشافعيَّة، والحَنابِلَة\n" +
                "اختلف العلماءُ فيما إذا سُقوا قبل خُروجِهم لصلاةِ الاستسقاءِ: هل يُصَلُّونَ أو لا؟ على قولينِ:\n" +
                "القَوْلُ الأَوَّل:\n" +
                "إذا سُقوا قبل خُروجِهم، يُستحبُّ أن يخرجوا ويُصَلُّوا، وهو مذهَبُ الحَنَفيَّة،والشافعيَّة، والحَنابِلَة ؛ وذلك لأنَّ الصلاة شُرِعَت لأَجْلِ العارِضِ من الجَدْب، وذلك لا يحصُلُ بمجَرَّدِ النُّزولِ\n" +
                "القول الثاني\n" +
                "\n" +
                ":إذا سُقوا قبل خُروجِهم، لا يخرجونَ للصَّلاةِ، وهو قولٌ للشَّافعيَّة؛ صحَّحه ابنُ الصَّلاحِ وهو اختيارُ ابنِ قُدامةَ وابنِ عثيمينَ ؛ وذلك لأنَّ صلاةَ الاستسقاءِ إنَّما تُشرَع لطلَبِ السُّقيا، فإذا سُقوا فلا حاجَةَ لها",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B3%D9%82%D8%A7%D8%A1/rp_00.png?raw=true"
    ),
    HowToPrayDto(
        title = "أوقاتها وشروطها",
        description = "يُستحبُّ أنْ تُصلَّى صلاةُ الاستسقاءِ وقتَ صلاةِ العِيد، وهذا مذهبُ الجمهورِ، من المالِكيَّة، والشافعيَّة، والحَنابِلَة" +
                "الأدلَّة:\n" +
                "أولًا: من السُّنَّة\n" +
                "عن عائشةَ رَضِيَ اللهُ عنها قالتْ:((شَكَا الناسُ إلى النبيِّ صلَّى اللهُ عليه وسلَّم قُحوطَ المطرِ، فأمَرَ بمِنبَرٍ فوُضِعَ له في المصلَّى، ووعَد الناسَ يومًا يَخرُجونَ فيه، فخرَجَ عليه الصَّلاةُ والسلامُ حين بدَا حاجبُ الشَّمس، فقَعَدَ على المنبرِ فكَبَّر وحمِدَ اللهَ...))\n" +
                "ثانيًا:\n" +
                "قياسًا على صلاة العِيدين؛ فهي تُشْبِهُها في الموضِع والصِّفَةِ، فكذلك في الوَقْتِ\n" +
                "لا يُشترطُ إذنُ الإمامِ للخروجِ لصَلاةِ الاستسقاءِ، وهذا مذهبُ الشافعيَّة، والحَنابِلَة، وهو قولُ ابنِ باز، وابنِ عُثيمين؛ وذلك لأنَّها صلاةُ نافلةٍ؛ فأشبهتْ صلاةَ سائرِ النوافِلِ في عدَمِ اشتراطِ إذنِ الإمام\n" +
                "يُكرَه إخراجُ البهائمِ، الى المصلى في صلاة الاستسقاء وهذا مذهبُ المالِكيَّة، وبه قال طائفةٌ من الشافعيَّة، وهو قولٌ للحنابلةاختارهابنُ قُدامةَ",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B3%D9%82%D8%A7%D8%A1/rp_01.png?raw=true"
    ),

    HowToPrayDto(
        title = "المكان",
        description = "يُستحبُّ أن تُصلَّى صلاةُ الاستسقاءِ في الصَّحراءِ كصلاةِ العيدِ، وهو مذهبُ الجمهورِ: المالِكيَّة ، والشافعيَّة ، والحَنابِلَة ، وحُكِيَ الإجماعُ على ذلك" +
                "الأدلَّة:\n" +
                "أولًا: من السُّنَّة\n" +
                "1-عن عبدِ اللهِ بنِ زيدِ بنِ عاصمٍ رَضِيَ اللهُ عنه:((أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم خرَجَ إلى المصلَّى، فاستسقى، فاستقبلَ القِبلةَ، وقلَب رِداءَه، وصَلَّى ركعتينِ ))\n" +
                "2-عن عائشةَ رَضِيَ اللهُ عنها، قالت:((شَكَا الناسُ إلى رسولِ الله صلَّى اللهُ عليه وسلَّم قحوطَ المطرِ، فأمَرَ بمِنبَرٍ فوُضِع له في المصلَّى ))\n" +
                "ثانيًا:\n" +
                "أنَّه يَحضُرها غالبُ الناسِ والصِّبيان وغيرهم؛ فكان المصلَّى أوسعَ لهم، وأرفقَ بهم\n" +
                "ثالثًا:\n" +
                "\n" +
                "أنَّه أبلغُ في الافتقارِ والتواضُعِ",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B3%D9%82%D8%A7%D8%A1/rp_02.jpeg?raw=true"
    ),
    HowToPrayDto(
        title = "صفة صلاة الاستسقاء",
        description = "صَلاةُ الاستسقاءِ رَكعتانِ، وهو مذهبُ الجمهور: المالِكيَّة، والشافعيَّة، والحَنابِلَة ،وحُكِي الإجماع على ذلك" +
                "الدَّليلُ مِنَ السُّنَّة:\n" +
                "عن عبدِ الله بنِ زيدٍ:((أنَّ النبيَّ صلَّى اللهُ عليه وسلَّم خرَجَ إلى المصلَّى، فاستسقى فاستقبلَ القِبلةَ، وقلَب رداءَه، وصلَّى رَكعتينِ ))\n" +
                "صلاةُ الاستسقاءِ ركعتانِ، يُكبِّر في الأولى سَبعًا، وفي الثانية خمسًا، وهذا مذهبُ الشافعيَّة، والحَنابِلَة، وبه قال بعضُ السَّلفِ\n" +
                "، واختاره داودُ الظاهريُّ ، و ابنُ باز, و ابنُ عثيمين\n" +
                "الدَّليلُ مِنَ السُّنَّة:\n" +
                "عن عبدِ اللهِ بن عبَّاسٍ رَضِيَ اللهُ عنهما، قال:((خرَج النبيُّ صلَّى اللهُ عليه وسلَّم متواضعًا، متبذِّلًا، متخشِّعًا، مترسِّلًا، متضرِّعًا، فصلَّى رَكعتينِ كما يُصلِّي في العيد، لم يخطُبْ خُطبتَكم هذه))\n" +
                "السُّنَّةُ الجهرُ بالقِراءةِ في صلاةِ الاستسقاءِ، وهو مذهب الجمهورِ: المالِكيَّة، والشَّافعيَّة، والحَنابِلَة، وحُكِي الإجماعُ على ذلك\n" +
                "الأدلَّة:\n" +
                "أولًا: من السُّنَّة\n" +
                "عن عبدِ اللهِ بنِ زيدٍ، قال:((رأيتُ النبيَّ صلَّى اللهُ عليه وسلَّم يوم خرَج يَستسقي، قال: فحوَّلَ إلى الناسِ ظَهرَه واستقبل القِبلةَ، ثم حوَّل رِداءَه، ثمَّ صلَّى لنا رَكعتينِ جهَر فيهما بالقِراءةِ ))\n" +
                "ثانيًا:\n" +
                "أنَّ هذه صلاةٌ شُرِعتْ لها الخُطبةُ؛ فكان مِن سُنَّتها الجهرُ كالجُمُعةِ والعِيدينِ",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B3%D9%82%D8%A7%D8%A1/rp_02.jpeg?raw=true"
    ),
    HowToPrayDto(
        title = "الخُطبة بعدَ صَلاةِ الاستسقاءِ",
        description = "تُشرَعُ الخُطبةُ مع صلاةِ الاستسقاءِ، وهذا مذهبُ الجمهورِ: المالِكيَّة، والشافعيَّة، والحَنابِلَة وحُكِيَ الإجماعُ على ذلك" +
                "الأدلَّة:\n" +
                "أولًا: من السُّنَّة\n" +
                "عن عائشةَ رَضِيَ اللهُ عنها، قالتْ:((شكَا الناسُ إلى رسولِ الله صلَّى اللهُ عليه وسلَّم قحوطَ المطرِ، فأمَرَ بمِنبَرٍ فوُضِع له في المصلَّى، ووَعَد الناس يومًا يَخرُجون فيه، قالت عائشةُ\n" +
                ": فخرَج رسولُ اللهِ صلَّى اللهُ عليه وسلَّم حين بدأ حاجبُ الشَّمس، فقَعَد على المِنبَرِ، فكَبَّر صلَّى اللهُ عليه وسلَّم وحمِد الله عزَّ وجلَّ، ثم قال: إنَّكم شكوتم جَدْبَ دِيارِكم، واستئخارَ المطرِ عن إبَّان زَمانِه عنكم، وقدْ أمرَكم الله عزَّ وجلَّ أن تَدْعُوه، ووعدَكم أن يَستجيبَ لكم... ثم رفَع يديه، فلم يزلْ في الرَّفْعِ حتى بدَا بياضُ إِبْطَيه، ثم حوَّل إلى الناسِ ظَهرَه، وقَلَبَ أو حَوَّل رداءَه، وهو رافعٌ يديه، ثم أقْبَل على الناسِ، ونزَل فصَلَّى ركعتينِ، فأنشأ اللهُ سحابةً، فرعدَتْ وبرَقتْ، ثم أمطرتْ بإذن الله، فلم يأتِ مسجدَه حتى سالتِ السُّيولُ، فلمَّا رأى سُرعتَهم إلى الكِنِّ ضَحِكَ صلَّى اللهُ عليه وسلَّم حتى بدَتْ نواجذُه، فقال: أَشهَدُ أنَّ اللهَ على كلِّ شيءٍ قديرٌ، وأنِّي عبدُ اللهِ ورسولُه ))\n" +
                "ثانيًا:\n" +
                "القياسُ على خُطبةِ العِيدينِ\n" +
                "اختَلَف العلماءُ في صِفة خُطبةِ الاستسقاءِ على قولين:\n" +
                "القول الأوّل\n" +
                ":أنَّ خُطبة الاستسقاء خُطبتانِ، وهذا مذهبُ المالِكيَّة، والشافعيَّة، ورواية عن أحمد، وقول محمَّد بن الحسَن من الحَنَفيَّة، وهو قولُ بعض السَّلف؛ وذلك قياسًا على خُطبةِ العِيدينِ\n" +
                "القول الثاني\n" +
                ":أنَّ خُطبةَ الاستسقاءِ خطبةٌ واحدة، وهذا مذهبُ الحَنابِلَة، وقولُ أبي يُوسفَ من الحَنَفيَّة،وبه قال عبدُ الرحمن بن مَهْديٍّ، واختاره ابنُ عثيمين\n" +
                "ختَلَف الفقهاءُ في خُطبة الاستسقاءِ؛ هل هي قبلَ الصلاةِ أو بعدَها؟ على أقوالٍ، أشهرُها قولان:\n" +
                "القول الأوّل\n" +
                ":أنَّ وقتَ خُطبةِ الاستسقاءِ بعدَ الصَّلاةِ، وهذا مذهبُ الجمهورِ: المالِكيَّة، والشافعيَّة، والحَنابِلَة، وقول أبي يُوسَفَ و محمَّد بن الحسن مِنَ الحَنَفيَّة ، وهو قولُ جماعةِ الفُقهاءِ\n" +
                "الأدلَّة:\n" +
                "عن عبدِ اللهِ بن عبَّاسٍ رَضِيَ اللهُ عنهما، قال:((خرَج النبيُّ صلَّى اللهُ عليه وسلَّم متواضعًا، متبذِّلًا، متخشِّعًا، مترسِّلًا، متضرِّعًا، فصلَّى ركعتينِ كما يُصلِّي في العيد، لم يخطُبْ خُطبتَكم هذه))\n" +
                "\n" +
                "القول الثاني:أنَّ الإمامَ مُخيَّرٌ بين الخُطبةِ قَبل الصَّلاةِ، أو الخُطبة بعدَها، وهي روايةٌ عن أحمد، واختارَه الشوكانيُّ، وابنُ باز، وابن عثيمين؛ وذلك لورود السُّنَّة بكِلا الأمرين، ودَلالتِها على كِلتَا الصِّفتينِ",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B3%D9%82%D8%A7%D8%A1/rp_03.jpeg?raw=true"
    ),
    HowToPrayDto(
        title = "تحويل الرداء اثناء الاستسقاء",
        description = "يُستحَبُّ للإمامِ والمأمومِ تحويلُ الرِّداءِ في الاستسقاءِ، وهذا مذهبُ الجمهورِ: المالِكيَّة،والشافعيَّة، والحَنابِلَة ، واختاره داودُ الظاهريُّ، وبه قال أكثرُ أهلِ العِلم، وحُكي الإجماعُ على ذلك" +
                "الأدلَّة:\n" +
                "عن عبدِ اللهِ بنِ زيدٍ رَضِيَ اللهُ عنه، قال:((خرَج رسولُ اللهِ صلَّى اللهُ عليه وسلَّم إلى المصلَّى يَستسقي، فاستقبل القِبلَةَ، وحوَّلَ رِداءَه، وصلّى رَكعتينِ ))\n" +
                "يُحَول الرداء في صلاةِ الاستسقاءِ أثناءَ الخُطبةِ، حين يستقبِلُ القبلة للدُّعاء، وهذا مذهَبُ الشافعيَّة، والحَنابِلَة، وقول عند الحَنَفيَّة، اختاره محمد و أبو يوسف من الحَنَفيَّة، ورواية عن مالك اختارها أصبغ ، وهو اختيار ابن المنذر\n" +
                "والشوكاني، و ابن باز، و ابن عثيمين\n" +
                "الدَّليلُ مِنَ السنة:\n" +
                "عبد الله بن زيد المازني يقول((خرج رسول الله صلَّى اللهُ عليه وسلَّم إلى المصلى فاستسقى وحوَّلَ رداءَه حين استقبَلَ القبلةَ))\n" +
                "يكون تحويلُ الرِّداءِ في صلاةِ الاستسقاءِ بجَعْلِ اليمينِ مكانَ اليسارِ والعكس، وهذا مذهبُ الجمهورِ : المالِكيَّة، والشافعية، والحَنابِلَة، وهو قولُ طائفةٍ مِنَ السَّلَف\n" +
                "الدليل:\n" +
                "\n" +
                "عن عبدِ الله بن زيد رَضِيَ اللهُ عنه قال: ((إنَّ النبيَّ صلَّى اللهُ عليه وسلَّم حَوَّلَ رِداءَه، وجعل عِطافَه الأيمنَ على عاتِقِه الأيسَرِ، وجَعَل عِطافَه الأَيْسَرَ على عاتِقِه الأيمنِ))",
        image = "https://github.com/Alikotb/Anees_Images/blob/main/%D8%B5%D9%84%D8%A7%D8%A9%20%D8%A7%D9%84%D8%A7%D8%B3%D8%AA%D8%B3%D9%82%D8%A7%D8%A1/rp_04.jpeg?raw=true"
    )
)